## 1. Pandas Series

In [1]:
import numpy as np
import pandas as pd

**# E.1. Create a series(my_series) with index is ['AMAZON', 'GOOG', 'AAPL', 'MSFT'], and values as ['1T', '808B','1.02T', '820B']**

In [2]:
# Your Code

In [3]:
my_series = pd.Series(['1T', '808B','1.02T', '820B'], index = ['AMAZON', 'GOOG', 'AAPL', 'MSFT'])
my_series

AMAZON       1T
GOOG       808B
AAPL      1.02T
MSFT       820B
dtype: object

**#E2. From the series below get the values of index 'g', 'h', 'i. Index by name**

In [4]:
np.random.seed(32)
my_series2 = pd.Series(np.random.randint(0,10,11), index = list('abcdefghijk'))
my_series2

a    7
b    5
c    6
d    8
e    3
f    7
g    9
h    3
i    5
j    9
k    4
dtype: int32

In [5]:
#Your Code

In [6]:
my_series2.loc[['g', 'h', 'i']]

g    9
h    3
i    5
dtype: int32

**#E3. From the series above get the values in the reverse order from k to d**

In [7]:
#Your Code

In [8]:
my_series2.iloc[11:2:-1]

k    4
j    9
i    5
h    3
g    9
f    7
e    3
d    8
dtype: int32

## 2. Pandas Data Frames

### 2.1 Basic creation, indexing

**#E.4 Create a Dataframe (my_df) of shape 3 x 4, filled with random numbers between 0 and 1**

column names should be ['c0', 'c1', 'c2', 'c3'], index should be ['r0', 'r1', 'r2']

In [9]:
np.random.seed(32)
#Your Code

In [10]:
np.random.seed(32)
my_df = pd.DataFrame(np.random.rand(3,4), columns = 'c0 c1 c2 c3'.split(), index = 'r0 r1 r2'.split())
my_df

          c0        c1        c2        c3
r0  0.858889  0.372711  0.555129  0.955657
r1  0.736670  0.816205  0.101087  0.928488
r2  0.609109  0.596553  0.091784  0.345186

**For further exercises, please use wine or boston dataframes created below**

In [11]:
wine = pd.read_csv('Wine.csv')
wine.head(3)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

In [12]:
boston = pd.read_csv('boston_housing.csv')
boston.head(3)

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7

**#E.5 In the wine dataframe above, a) print  the dimensions of the data frame, b) print a list of all column names**

**# a) print dimensions of wine data frame**

In [13]:
# Your Code

In [14]:
wine.shape

(178, 15)

**# b) print a list ofall column names**

In [15]:
# Your Code

In [16]:
list(wine.columns)

['Unnamed: 0',
 'Type',
 'Alcohol',
 'Malic',
 'Ash',
 'Alcalinity',
 'Magnesium',
 'Phenols',
 'Flavanoids',
 'Nonflavanoids',
 'Proanthocyanins',
 'Color',
 'Hue',
 'Dilution',
 'Proline']

**E.6 Get a subset of wine data frame which contains first 3 rows and columns 'Type', 'Alochol', 'Phenols'**

In [17]:
# Your Code

In [18]:
wine.loc[:, ['Type','Alcohol', 'Phenols']].head(3)

   Type  Alcohol  Phenols
0     1    14.23     2.80
1     1    13.20     2.65
2     1    13.16     2.80

### 2.2 Few important data frame methods to analyze the data

**#E.7 From the wine dataframe, get the mean alcohol content**

In [19]:
# Your Code

In [20]:
wine['Alcohol'].mean()

13.000617977528083

**#E.8 From the boston data frame, get the row, where CRIM is maximum. We can do this without boolean indexing** 

***Hint: Use idxmax()***

In [21]:
# Your Code

In [22]:
boston.loc[boston['CRIM'].idxmax(),:]

Unnamed: 0    380.0000
CRIM           88.9762
ZN              0.0000
INDUS          18.1000
CHAS            0.0000
NOX             0.6710
RM              6.9680
AGE            91.9000
DIS             1.4165
RAD            24.0000
TAX           666.0000
PTRATIO        20.2000
B             396.9000
LSTAT          17.2100
MEDV           10.4000
Name: 380, dtype: float64

**#E.9 From the boston data frame, get the unique values in 'ZN' column**

In [23]:
# Your Code

In [24]:
boston['ZN'].unique()

array([ 18. ,   0. ,  12.5,  75. ,  21. ,  90. ,  85. , 100. ,  25. ,
        17.5,  80. ,  28. ,  45. ,  60. ,  95. ,  82.5,  30. ,  22. ,
        20. ,  40. ,  55. ,  52.5,  70. ,  34. ,  33. ,  35. ])

**#E.10 Get the number of unique values for each column. Hint: use .nunique()**

In [25]:
# Your Code

In [26]:
boston.nunique()

Unnamed: 0    506
CRIM          504
ZN             26
INDUS          76
CHAS            2
NOX            81
RM            446
AGE           356
DIS           412
RAD             9
TAX            66
PTRATIO        46
B             357
LSTAT         455
MEDV          229
dtype: int64

**#E.11 From the boston data frame, get the number of unique values for 'RAD' and their frequency**

In [27]:
# Your Code

In [28]:
boston['RAD'].value_counts()

24.0    132
5.0     115
4.0     110
3.0      38
6.0      26
8.0      24
2.0      24
1.0      20
7.0      17
Name: RAD, dtype: int64

**E.12 From boston data frame, get mean MEDV value for each 'RAD' categogry**

In [29]:
# Your Code

In [30]:
boston.groupby('RAD')['MEDV'].mean()

RAD
1.0     24.365000
2.0     26.833333
3.0     27.928947
4.0     21.387273
5.0     25.706957
6.0     20.976923
7.0     27.105882
8.0     30.358333
24.0    16.403788
Name: MEDV, dtype: float64

### 2.3 Boolean Masking

**#E.13 Re-do Exercise 8, with boolean masking**

In [31]:
# Your Code

In [32]:
boston.loc[boston['CRIM'] == boston['CRIM'].max(),:]

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
380,380,88.9762,0.0,18.1,0.0,0.671,6.968,91.9,1.4165,24.0,666.0,20.2,396.9,17.21,10.4

**E.14 Get all rows and columns 'NOX', 'DIS', 'RAD', 'TAX', 'MEDV' when CRIM is greater than 70**

In [33]:
# Your Code

In [34]:
boston.loc[boston['CRIM'] > 70, ['NOX', 'DIS', 'RAD', 'TAX', 'MEDV']]

       NOX     DIS   RAD    TAX  MEDV
380  0.671  1.4165  24.0  666.0  10.4
418  0.679  1.8026  24.0  666.0   8.8

## 2.4 Modifying DataFrames

**# E.15 remove the columns 'Unnamed:0' and 'CHAS' from the data frame and list only first 3 rows**

In [35]:
# Your Code

In [36]:
boston.drop(['Unnamed: 0', 'CHAS'],1).head(3)

,CRIM,ZN,INDUS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7

## 2.5 Missing Values

**# E.16 Select rows without any missing values**

In [37]:
d = {"A": [1,2,3,7,13,12], "B": [4,12, 15, np.nan, 5, 8], "C":[10, 11, np.nan, np.nan, 9, 12], 
     "D":[3,6,np.nan, 9, np.nan, 11], "E":[30,11,np.nan, 9, np.nan,11]}
df = pd.DataFrame(d)
df

    A     B     C     D     E
0   1   4.0  10.0   3.0  30.0
1   2  12.0  11.0   6.0  11.0
2   3  15.0   NaN   NaN   NaN
3   7   NaN   NaN   9.0   9.0
4  13   5.0   9.0   NaN   NaN
5  12   8.0  12.0  11.0  11.0

In [38]:
# Your Code

In [39]:
df.dropna()

    A     B     C     D     E
0   1   4.0  10.0   3.0  30.0
1   2  12.0  11.0   6.0  11.0
5  12   8.0  12.0  11.0  11.0

**# E.17 Get columns that have atleast 5 non-missing values**

In [40]:
# Your Code

In [41]:
df.dropna(axis=1,thresh=5)

    A     B
0   1   4.0
1   2  12.0
2   3  15.0
3   7   NaN
4  13   5.0
5  12   8.0

**# E.18 Fill all the misisng values with the maximum value of each column**

In [42]:
#Your Code

In [43]:
df.fillna(df.max(axis=0), axis=0)

    A     B     C     D     E
0   1   4.0  10.0   3.0  30.0
1   2  12.0  11.0   6.0  11.0
2   3  15.0  12.0  11.0  30.0
3   7  15.0  12.0   9.0   9.0
4  13   5.0   9.0  11.0  30.0
5  12   8.0  12.0  11.0  11.0